In [1]:
import os
import pandas as pd

In [2]:
print(os.getcwd())
os.chdir("E:/Data Science _TR/Datasets")
print(os.getcwd())

D:\ENTRI\ENTRI_DATASCIENCE\Part 3- Machine Learning
E:\Data Science _TR\Datasets

In [3]:
df= pd.read_csv("Salary.csv")
df

  Country  Age   Salary
0   India    44   72000
1      US    34   65000
2   Japan    46   98000
3      US    35   45000
4   Japan    23   34000

In [4]:
df.dtypes

Country    object
Age         int64
Salary      int64
dtype: object

In [5]:
from sklearn import preprocessing

## Label Encoder

In [6]:
label_encoder=preprocessing.LabelEncoder()

In [9]:
df['Country']= label_encoder.fit_transform(df['Country'])

In [10]:
print(df.head())

   Country  Age   Salary
0        0    44   72000
1        2    34   65000
2        1    46   98000
3        2    35   45000
4        1    23   34000

## One Hot Encoder

In [11]:
from sklearn.preprocessing import OneHotEncoder
onehotencoder=OneHotEncoder()

In [12]:
X = onehotencoder.fit_transform(df.Country.values.reshape(-1,1)).toarray()

In [14]:
dfOneHot = pd.DataFrame(X, columns = ["Country_"+str(int(i)) for i in range(df.shape[1])]) 
dfOneHot

   Country_0  Country_1  Country_2
0        1.0        0.0        0.0
1        0.0        0.0        1.0
2        0.0        1.0        0.0
3        0.0        0.0        1.0
4        0.0        1.0        0.0

In [15]:
dfcon = pd.concat([df, dfOneHot], axis=1)
dfcon

   Country  Age   Salary  Country_0  Country_1  Country_2
0        0    44   72000        1.0        0.0        0.0
1        2    34   65000        0.0        0.0        1.0
2        1    46   98000        0.0        1.0        0.0
3        2    35   45000        0.0        0.0        1.0
4        1    23   34000        0.0        1.0        0.0

In [16]:
df2= dfcon.drop(['Country'], axis=1) 
df2

   Age   Salary  Country_0  Country_1  Country_2
0    44   72000        1.0        0.0        0.0
1    34   65000        0.0        0.0        1.0
2    46   98000        0.0        1.0        0.0
3    35   45000        0.0        0.0        1.0
4    23   34000        0.0        1.0        0.0

In [ ]:
df2

In [17]:
import statsmodels.api as sm
#sm - https://www.statsmodels.org/stable/index.html
sm

In [18]:
def calculate_vif(df2): 
    vif_df = pd.DataFrame(columns = ['Var', 'Vif']) 
    x_var_names = df2.columns 
    for i in range(0, x_var_names.shape[0]): 
        y = df2[x_var_names[i]] 
        x = df2[x_var_names.drop([x_var_names[i]])] 
        r_squared = sm.OLS(y,x).fit().rsquared 
        vif = round(1/(1-r_squared),2) 
        vif_df.loc[i] = [x_var_names[i], vif] 
    return vif_df.sort_values(by = 'Vif', axis = 0, ascending=False, inplace=False)

In [19]:
print(calculate_vif(df2))

         Var    Vif
4  Country_2  22.04
2  Country_0  17.40
3  Country_1  16.26
0       Age   11.04
1     Salary   9.55

In [ ]:
#df2.columns[[4]]

In [20]:
# calculating vif value by droping salary variable from df2

X=df2.drop(['Salary'],axis=1) 
calculate_vif(X)

         Var   Vif
2  Country_1  9.98
3  Country_2  9.98
1  Country_0  8.31
0       Age   1.27

In [21]:
# calculating vif value by droping age variable from df2 # axis =1 represent columns

df_vif = X.drop(df2.columns[[4]],axis=1)
calculate_vif(df_vif)

         Var   Vif
0       Age   2.63
2  Country_1  1.90
1  Country_0  1.73